[Timeout] StringLiteral
db/database.js:7:40
 
 const sqlite = sqlite3.verbose();
 
-const dbFile = path.resolve(__dirname, 'users.db');
+const dbFile = path.resolve(__dirname, "");
 const db = new sqlite.Database(dbFile, (err) => {
   if (err) {

[Killed] BlockStatement
db/database.js:8:49
 const sqlite = sqlite3.verbose();
 
 const dbFile = path.resolve(__dirname, 'users.db');
-const db = new sqlite.Database(dbFile, (err) => {
-  if (err) {
-    console.error('Could not connect to database:', err.message);
-  } else {
-    console.log('Connected to SQLite database');
-    initDatabase();
-  }
-});
+const db = new sqlite.Database(dbFile, (err) => {});
 
 
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
db/database.js:9:12
 
 const dbFile = path.resolve(__dirname, 'users.db');
 const db = new sqlite.Database(dbFile, (err) => {
-  if (err) {
-    console.error('Could not connect to database:', err.message);
-  } else {
+  if (err) {} else {
     console.log('Connected to SQLite database');
     initDatabase();
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "This is a test playlist", "id": 2017, "language_code": null, "last_open_time": 0, "name": "Test Playlist", "number_of_cards": 0, "user_id": 1}]

[Killed] ConditionalExpression
db/database.js:9:7
 
 const dbFile = path.resolve(__dirname, 'users.db');
 const db = new sqlite.Database(dbFile, (err) => {
-  if (err) {
+  if (true) {
     console.error('Could not connect to database:', err.message);
   } else {
killedBy: Playlist Model should add a playlist successfully
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Killed] BlockStatement
db/database.js:11:10
 const db = new sqlite.Database(dbFile, (err) => {
   if (err) {
     console.error('Could not connect to database:', err.message);
-  } else {
-    console.log('Connected to SQLite database');
-    initDatabase();
-  }
+  } else {}
 });
 
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
db/database.js:18:42
 });
 
 
-export function getWordsByUserId(userId) {
-  return new Promise((resolve, reject) => {
-    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) {
-        reject(err);
-      } else {
-        resolve(rows);
-      }
-    });
-  });
-}
+export function getWordsByUserId(userId) {}
 
 export function getPlaylistsByUserId(userId) {
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Killed] BlockStatement
db/database.js:19:43
 
 
 export function getWordsByUserId(userId) {
-  return new Promise((resolve, reject) => {
-    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) {
-        reject(err);
-      } else {
-        resolve(rows);
-      }
-    });
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
db/database.js:20:78
 
 export function getWordsByUserId(userId) {
   return new Promise((resolve, reject) => {
-    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) {
-        reject(err);
-      } else {
-        resolve(rows);
-      }
-    });
+    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {});
   });
 }
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArrayDeclaration
db/database.js:20:53
 
 export function getWordsByUserId(userId) {
   return new Promise((resolve, reject) => {
-    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
+    db.all('SELECT * FROM words WHERE user_id = ?', [], (err, rows) => {
       if (err) {
         reject(err);
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
db/database.js:21:11
 export function getWordsByUserId(userId) {
   return new Promise((resolve, reject) => {
     db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) {
+      if (false) {
         reject(err);
       } else {
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"description": "Description 2", "id": 2114, "language_code": "es", "last_open_time": 0, "name": "User 1 Playlist 2", "number_of_cards": 0, "user_id": 1}]

[Killed] ConditionalExpression
db/database.js:21:11
 export function getWordsByUserId(userId) {
   return new Promise((resolve, reject) => {
     db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) {
+      if (true) {
         reject(err);
       } else {
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Killed] BlockStatement
db/database.js:23:14
     db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
       if (err) {
         reject(err);
-      } else {
-        resolve(rows);
-      }
+      } else {}
     });
   });
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3

[Killed] BlockStatement
db/database.js:30:46
   });
 }
 
-export function getPlaylistsByUserId(userId) {
-  return new Promise((resolve, reject) => {
-    db.all(
-      'SELECT * FROM playlists WHERE user_id = ?',
-      [userId],
-      (err, rows) => {
-        if (err) {
-          reject(err);
-        } else {
-          resolve(rows);
-        }
-      },
-    );
-  });
-}
+export function getPlaylistsByUserId(userId) {}
 
 export function initDatabase() {
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User 1 Playlist 1"
Received: "User 1 Playlist 2"

[Killed] BlockStatement
db/database.js:31:43
 }
 
 export function getPlaylistsByUserId(userId) {
-  return new Promise((resolve, reject) => {
-    db.all(
-      'SELECT * FROM playlists WHERE user_id = ?',
-      [userId],
-      (err, rows) => {
-        if (err) {
-          reject(err);
-        } else {
-          resolve(rows);
-        }
-      },
-    );
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
db/database.js:35:22
     db.all(
       'SELECT * FROM playlists WHERE user_id = ?',
       [userId],
-      (err, rows) => {
-        if (err) {
-          reject(err);
-        } else {
-          resolve(rows);
-        }
-      },
+      (err, rows) => {},
     );
   });
killedBy: Playlist Model should delete a playlist by ID
statusReason: Error: Playlist not found

[Killed] ConditionalExpression
db/database.js:36:13
       'SELECT * FROM playlists WHERE user_id = ?',
       [userId],
       (err, rows) => {
-        if (err) {
+        if (false) {
           reject(err);
         } else {
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
db/database.js:36:13
       'SELECT * FROM playlists WHERE user_id = ?',
       [userId],
       (err, rows) => {
-        if (err) {
+        if (true) {
           reject(err);
         } else {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3

[Survived] BlockStatement
db/database.js:56:18
           email TEXT UNIQUE,
           password TEXT
         )`,
-        (err) => {
-          if (err) return reject(`Error creating users table: ${err.message}`);
-        }
+        (err) => {}
       );
 

[Killed] ConditionalExpression
db/database.js:57:15
           password TEXT
         )`,
         (err) => {
-          if (err) return reject(`Error creating users table: ${err.message}`);
+          if (true) return reject(`Error creating users table: ${err.message}`);
         }
       );
killedBy: Integration POST /playlists should create a new playlist
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Survived] ConditionalExpression
db/database.js:57:15
           password TEXT
         )`,
         (err) => {
-          if (err) return reject(`Error creating users table: ${err.message}`);
+          if (false) return reject(`Error creating users table: ${err.message}`);
         }
       );

[Survived] BlockStatement
db/database.js:72:18
           review_stage INTEGER DEFAULT 0,
           FOREIGN KEY (user_id) REFERENCES users(id)
         )`,
-        (err) => {
-          if (err) return reject(`Error creating words table: ${err.message}`);
-        }
+        (err) => {}
       );
 

[Killed] ConditionalExpression
db/database.js:73:15
           FOREIGN KEY (user_id) REFERENCES users(id)
         )`,
         (err) => {
-          if (err) return reject(`Error creating words table: ${err.message}`);
+          if (false) return reject(`Error creating words table: ${err.message}`);
         }
       );
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "name"

Expected value: "Playlist 1"
Received value: "Test Playlist"

[Timeout] ConditionalExpression
db/database.js:73:15
           FOREIGN KEY (user_id) REFERENCES users(id)
         )`,
         (err) => {
-          if (err) return reject(`Error creating words table: ${err.message}`);
+          if (true) return reject(`Error creating words table: ${err.message}`);
         }
       );

[Survived] BlockStatement
db/database.js:88:18
           number_of_cards INTEGER DEFAULT 0,
           FOREIGN KEY (user_id) REFERENCES users(id)
         )`,
-        (err) => {
-          if (err) return reject(`Error creating playlists table: ${err.message}`);
-        }
+        (err) => {}
       );
 

[Timeout] ConditionalExpression
db/database.js:89:15
           FOREIGN KEY (user_id) REFERENCES users(id)
         )`,
         (err) => {
-          if (err) return reject(`Error creating playlists table: ${err.message}`);
+          if (true) return reject(`Error creating playlists table: ${err.message}`);
         }
       );

[Survived] ConditionalExpression
db/database.js:89:15
           FOREIGN KEY (user_id) REFERENCES users(id)
         )`,
         (err) => {
-          if (err) return reject(`Error creating playlists table: ${err.message}`);
+          if (false) return reject(`Error creating playlists table: ${err.message}`);
         }
       );

[Survived] BlockStatement
db/database.js:98:33
   });
 }
 
-export function closeDatabase() {
-  return new Promise((resolve, reject) => {
-    db.close((err) => {
-      if (err) reject(`Error closing database: ${err.message}`);
-      else resolve();
-    });
-  });
-}
+export function closeDatabase() {}
 
 

[Survived] BlockStatement
db/database.js:99:43
 }
 
 export function closeDatabase() {
-  return new Promise((resolve, reject) => {
-    db.close((err) => {
-      if (err) reject(`Error closing database: ${err.message}`);
-      else resolve();
-    });
-  });
+  return new Promise((resolve, reject) => {});
 }
 

[Killed] BlockStatement
db/database.js:100:23
 
 export function closeDatabase() {
   return new Promise((resolve, reject) => {
-    db.close((err) => {
-      if (err) reject(`Error closing database: ${err.message}`);
-      else resolve();
-    });
+    db.close((err) => {});
   });
 }
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Survived] ConditionalExpression
db/database.js:101:11
 export function closeDatabase() {
   return new Promise((resolve, reject) => {
     db.close((err) => {
-      if (err) reject(`Error closing database: ${err.message}`);
+      if (true) reject(`Error closing database: ${err.message}`);
       else resolve();
     });

[Survived] ConditionalExpression
db/database.js:101:11
 export function closeDatabase() {
   return new Promise((resolve, reject) => {
     db.close((err) => {
-      if (err) reject(`Error closing database: ${err.message}`);
+      if (false) reject(`Error closing database: ${err.message}`);
       else resolve();
     });
