[Killed] BlockStatement
db/playlistModel.js:3:49
 import { db } from './database.js';
 
-export const getPlaylistsByUserId = (userId) => {
-  return new Promise((resolve, reject) => {
-    db.all(
-      'SELECT * FROM playlists WHERE user_id = ?',
-      [userId],
-      (err, rows) => {
-        if (err) {
-          reject(err);
-        } else {
-          resolve(rows);
-        }
-      },
-    );
-  });
-};
+export const getPlaylistsByUserId = (userId) => {};
 
 export const getPlaylistById = (playlistId) => {
killedBy: Playlist Model should get playlists by user ID
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Timeout] BlockStatement
db/playlistModel.js:4:43
 import { db } from './database.js';
 
 export const getPlaylistsByUserId = (userId) => {
-  return new Promise((resolve, reject) => {
-    db.all(
-      'SELECT * FROM playlists WHERE user_id = ?',
-      [userId],
-      (err, rows) => {
-        if (err) {
-          reject(err);
-        } else {
-          resolve(rows);
-        }
-      },
-    );
-  });
+  return new Promise((resolve, reject) => {});
 };
 

[Killed] ArrayDeclaration
db/playlistModel.js:7:7
   return new Promise((resolve, reject) => {
     db.all(
       'SELECT * FROM playlists WHERE user_id = ?',
-      [userId],
+      [],
       (err, rows) => {
         if (err) {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Survived] BlockStatement
db/playlistModel.js:9:18
       'SELECT * FROM playlists WHERE user_id = ?',
       [userId],
       (err, rows) => {
-        if (err) {
-          reject(err);
-        } else {
+        if (err) {} else {
           resolve(rows);
         }

[Killed] BlockStatement
db/playlistModel.js:19:48
   });
 };
 
-export const getPlaylistById = (playlistId) => {
-  return new Promise((resolve, reject) => {
-      db.get('SELECT * FROM playlists WHERE id = ?', [playlistId], (err, row) => {
-          if (err) {
-              reject(err);
-          } else {
-              resolve(row || null);
-          }
-      });
-  });
-};
+export const getPlaylistById = (playlistId) => {};
 
 
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Timeout] BlockStatement
db/playlistModel.js:20:43
 };
 
 export const getPlaylistById = (playlistId) => {
-  return new Promise((resolve, reject) => {
-      db.get('SELECT * FROM playlists WHERE id = ?', [playlistId], (err, row) => {
-          if (err) {
-              reject(err);
-          } else {
-              resolve(row || null);
-          }
-      });
-  });
+  return new Promise((resolve, reject) => {});
 };
 

[Timeout] BlockStatement
db/playlistModel.js:21:82
 
 export const getPlaylistById = (playlistId) => {
   return new Promise((resolve, reject) => {
-      db.get('SELECT * FROM playlists WHERE id = ?', [playlistId], (err, row) => {
-          if (err) {
-              reject(err);
-          } else {
-              resolve(row || null);
-          }
-      });
+      db.get('SELECT * FROM playlists WHERE id = ?', [playlistId], (err, row) => {});
   });
 };

[Killed] ArrayDeclaration
db/playlistModel.js:21:54
 
 export const getPlaylistById = (playlistId) => {
   return new Promise((resolve, reject) => {
-      db.get('SELECT * FROM playlists WHERE id = ?', [playlistId], (err, row) => {
+      db.get('SELECT * FROM playlists WHERE id = ?', [], (err, row) => {
           if (err) {
               reject(err);
killedBy: Playlist Model should get a playlist by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"description": "Test Description", "id": 2561, "language_code": "en", "name": "Test Playlist", "user_id": 1}
Received: null

[Killed] ConditionalExpression
db/playlistModel.js:22:15
 export const getPlaylistById = (playlistId) => {
   return new Promise((resolve, reject) => {
       db.get('SELECT * FROM playlists WHERE id = ?', [playlistId], (err, row) => {
-          if (err) {
+          if (true) {
               reject(err);
           } else {
killedBy: Playlist Model should get a playlist by ID
statusReason: Error: thrown: null

[Survived] ConditionalExpression
db/playlistModel.js:22:15
 export const getPlaylistById = (playlistId) => {
   return new Promise((resolve, reject) => {
       db.get('SELECT * FROM playlists WHERE id = ?', [playlistId], (err, row) => {
-          if (err) {
+          if (false) {
               reject(err);
           } else {

[Timeout] BlockStatement
db/playlistModel.js:24:18
       db.get('SELECT * FROM playlists WHERE id = ?', [playlistId], (err, row) => {
           if (err) {
               reject(err);
-          } else {
-              resolve(row || null);
-          }
+          } else {}
       });
   });

[Killed] LogicalOperator
db/playlistModel.js:25:23
           if (err) {
               reject(err);
           } else {
-              resolve(row || null);
+              resolve(row && null);
           }
       });
killedBy: Playlist Model should get a playlist by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"description": "Test Description", "id": 2628, "language_code": "en", "name": "Test Playlist", "user_id": 1}
Received: null

[Killed] ConditionalExpression
db/playlistModel.js:25:23
           if (err) {
               reject(err);
           } else {
-              resolve(row || null);
+              resolve(false);
           }
       });
killedBy: Playlist Model should get a playlist by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"description": "Test Description", "id": 2639, "language_code": "en", "name": "Test Playlist", "user_id": 1}
Received: false

[Killed] ConditionalExpression
db/playlistModel.js:34:9
 
 export const addPlaylist = ({ name, description, user_id, language_code }) => {
   return new Promise((resolve, reject) => {
-    if (!name || !user_id) {
+    if (false) {
       const missingFields = [];
       if (!name) missingFields.push('name');
killedBy: Playlist Model should throw an error if required fields are missing
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"description": "Missing name and user_id", "id": 2647, "language_code": "en", "last_open_time": 0, "name": undefined, "number_of_cards": 0, "user_id": undefined}

[Killed] LogicalOperator
db/playlistModel.js:34:9
 
 export const addPlaylist = ({ name, description, user_id, language_code }) => {
   return new Promise((resolve, reject) => {
-    if (!name || !user_id) {
+    if (!name && !user_id) {
       const missingFields = [];
       if (!name) missingFields.push('name');
killedBy: Playlist Model should throw an error if required fields are missing
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"description": "Test Description", "id": 2658, "language_code": undefined, "last_open_time": 0, "name": "Missing user_id", "number_of_cards": 0, "user_id": undefined}

[Killed] ConditionalExpression
db/playlistModel.js:36:11
   return new Promise((resolve, reject) => {
     if (!name || !user_id) {
       const missingFields = [];
-      if (!name) missingFields.push('name');
+      if (false) missingFields.push('name');
       if (!user_id) missingFields.push('user_id');
       reject(new Error(`Missing required fields: ${missingFields.join(', ')}`));
killedBy: Playlist Model should throw an error if required fields are missing
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Missing required fields: name, user_id"
Received message:   "Missing required fields: user_id"

      142 |             if (stryMutAct_9fa48("210") ? false : stryMutAct_9fa48("209") ? true : stryMutAct_9fa48("208") ? name : (stryCov_9fa48("208", "209", "210"), !name)) missingFields.push(stryMutAct_9fa48("211") ? "" : (stryCov_

[Killed] BooleanLiteral
db/playlistModel.js:36:11
   return new Promise((resolve, reject) => {
     if (!name || !user_id) {
       const missingFields = [];
-      if (!name) missingFields.push('name');
+      if (name) missingFields.push('name');
       if (!user_id) missingFields.push('user_id');
       reject(new Error(`Missing required fields: ${missingFields.join(', ')}`));
killedBy: Playlist Model should throw an error if required fields are missing
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Missing required fields: name, user_id"
Received message:   "Missing required fields: user_id"

      142 |             if (stryMutAct_9fa48("210") ? false : stryMutAct_9fa48("209") ? true : stryMutAct_9fa48("208") ? name : (stryCov_9fa48("208", "209", "210"), !name)) missingFields.push(stryMutAct_9fa48("211") ? "" : (stryCov_

[Killed] ConditionalExpression
db/playlistModel.js:37:11
     if (!name || !user_id) {
       const missingFields = [];
       if (!name) missingFields.push('name');
-      if (!user_id) missingFields.push('user_id');
+      if (true) missingFields.push('user_id');
       reject(new Error(`Missing required fields: ${missingFields.join(', ')}`));
       return;
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
db/playlistModel.js:37:11
     if (!name || !user_id) {
       const missingFields = [];
       if (!name) missingFields.push('name');
-      if (!user_id) missingFields.push('user_id');
+      if (false) missingFields.push('user_id');
       reject(new Error(`Missing required fields: ${missingFields.join(', ')}`));
       return;
killedBy: Playlist Model should throw an error if required fields are missing
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Missing required fields: name, user_id"
Received message:   "Missing required fields: name"

      142 |             if (stryMutAct_9fa48("210") ? false : stryMutAct_9fa48("209") ? true : stryMutAct_9fa48("208") ? name : (stryCov_9fa48("208", "209", "210"), !name)) missingFields.push(stryMutAct_9fa48("211") ? "" : (stryCov_9fa

[Killed] ArrayDeclaration
db/playlistModel.js:44:7
 
     db.run(
       'INSERT INTO playlists (name, description, user_id, language_code, last_open_time) VALUES (?, ?, ?, ?, ?)',
-      [name, description, user_id, language_code, 0],
+      [],
       function (err) {
         if (err) {
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Timeout] BlockStatement
db/playlistModel.js:45:22
     db.run(
       'INSERT INTO playlists (name, description, user_id, language_code, last_open_time) VALUES (?, ?, ?, ?, ?)',
       [name, description, user_id, language_code, 0],
-      function (err) {
-        if (err) {
-          reject(err);
-        } else {
-          resolve({
-            id: this.lastID,
-            name,
-            description,
-            user_id,
-            language_code,
-            last_open_time: 0,
-            number_of_cards: 0,
-          });
-        }
-      },
+      function (err) {},
     );
   });

[Killed] ConditionalExpression
db/playlistModel.js:46:13
       'INSERT INTO playlists (name, description, user_id, language_code, last_open_time) VALUES (?, ?, ?, ?, ?)',
       [name, description, user_id, language_code, 0],
       function (err) {
-        if (err) {
+        if (false) {
           reject(err);
         } else {
killedBy: Playlist Model should throw an error if database fails
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Database error"
Received message:   "Cannot read properties of undefined (reading 'lastID')"

      164 |                 stryCov_9fa48("224");
      165 |                 resolve(stryMutAct_9fa48("225") ? {} : (stryCov_9fa48("225"), {
    > 166 |                   id: this.lastID,

[Killed] BlockStatement
db/playlistModel.js:46:18
       'INSERT INTO playlists (name, description, user_id, language_code, last_open_time) VALUES (?, ?, ?, ?, ?)',
       [name, description, user_id, language_code, 0],
       function (err) {
-        if (err) {
-          reject(err);
-        } else {
+        if (err) {} else {
           resolve({
             id: this.lastID,
killedBy: Playlist Model should throw an error if database fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] BlockStatement
db/playlistModel.js:48:16
       function (err) {
         if (err) {
           reject(err);
-        } else {
-          resolve({
-            id: this.lastID,
-            name,
-            description,
-            user_id,
-            language_code,
-            last_open_time: 0,
-            number_of_cards: 0,
-          });
-        }
+        } else {}
       },
     );

[Killed] BlockStatement
db/playlistModel.js:64:59
   });
 };
 
-export const deletePlaylistById = (playlistId, userId) => {
-  return new Promise((resolve, reject) => {
-      db.run(
-          'DELETE FROM playlists WHERE id = ? AND user_id = ?',
-          [playlistId, userId],
-          function (err) {
-              if (err) {
-                  reject(err);
-              } else if (this.changes === 0) {
-                  reject(new Error('Playlist not found'));
-              } else {
-                  resolve(true);
-              }
-          },
-      );
-  });
-};
+export const deletePlaylistById = (playlistId, userId) => {};
 
 
killedBy: Playlist Model should delete a playlist by ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Timeout] BlockStatement
db/playlistModel.js:65:43
 };
 
 export const deletePlaylistById = (playlistId, userId) => {
-  return new Promise((resolve, reject) => {
-      db.run(
-          'DELETE FROM playlists WHERE id = ? AND user_id = ?',
-          [playlistId, userId],
-          function (err) {
-              if (err) {
-                  reject(err);
-              } else if (this.changes === 0) {
-                  reject(new Error('Playlist not found'));
-              } else {
-                  resolve(true);
-              }
-          },
-      );
-  });
+  return new Promise((resolve, reject) => {});
 };
 

[Timeout] BlockStatement
db/playlistModel.js:69:26
       db.run(
           'DELETE FROM playlists WHERE id = ? AND user_id = ?',
           [playlistId, userId],
-          function (err) {
-              if (err) {
-                  reject(err);
-              } else if (this.changes === 0) {
-                  reject(new Error('Playlist not found'));
-              } else {
-                  resolve(true);
-              }
-          },
+          function (err) {},
       );
   });

[Killed] ConditionalExpression
db/playlistModel.js:70:19
           'DELETE FROM playlists WHERE id = ? AND user_id = ?',
           [playlistId, userId],
           function (err) {
-              if (err) {
+              if (true) {
                   reject(err);
               } else if (this.changes === 0) {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Description 1", "id": 2886, "language_code": null, "last_open_time": 0, "name": "Playlist 1", "number_of_cards": 0, "user_id": 1}]

[Survived] BlockStatement
db/playlistModel.js:70:24
           'DELETE FROM playlists WHERE id = ? AND user_id = ?',
           [playlistId, userId],
           function (err) {
-              if (err) {
-                  reject(err);
-              } else if (this.changes === 0) {
+              if (err) {} else if (this.changes === 0) {
                   reject(new Error('Playlist not found'));
               } else {

[Killed] EqualityOperator
db/playlistModel.js:72:26
           function (err) {
               if (err) {
                   reject(err);
-              } else if (this.changes === 0) {
+              } else if (this.changes !== 0) {
                   reject(new Error('Playlist not found'));
               } else {
killedBy: Playlist Model should delete a playlist by ID
statusReason: Error: Playlist not found

[Killed] BlockStatement
db/playlistModel.js:72:46
           function (err) {
               if (err) {
                   reject(err);
-              } else if (this.changes === 0) {
-                  reject(new Error('Playlist not found'));
-              } else {
+              } else if (this.changes === 0) {} else {
                   resolve(true);
               }
killedBy: Playlist Model should throw an error when deleting a non-existent playlist
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
db/playlistModel.js:73:36
               if (err) {
                   reject(err);
               } else if (this.changes === 0) {
-                  reject(new Error('Playlist not found'));
+                  reject(new Error(""));
               } else {
                   resolve(true);

[Timeout] BlockStatement
db/playlistModel.js:74:22
                   reject(err);
               } else if (this.changes === 0) {
                   reject(new Error('Playlist not found'));
-              } else {
-                  resolve(true);
-              }
+              } else {}
           },
       );

[Killed] BooleanLiteral
db/playlistModel.js:75:27
               } else if (this.changes === 0) {
                   reject(new Error('Playlist not found'));
               } else {
-                  resolve(true);
+                  resolve(false);
               }
           },
killedBy: Playlist Model should delete a playlist by ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
db/playlistModel.js:83:55
 };
 
 
-export const updatePlaylistOpenTime = (playlistId) => {
-  return new Promise((resolve, reject) => {
-      const currentTime = Date.now();
-      db.run(
-          'UPDATE playlists SET last_open_time = ? WHERE id = ?',
-          [currentTime, playlistId],
-          function (err) {
-              if (err) {
-                  reject(err);
-              } else if (this.changes === 0) {
-                  reject(new Error('Playlist not found'));
-              } else {
-                  resolve({
-                      message: 'Playlist open time updated',
-                      last_open_time: currentTime,
-                  });
-              }
-          },
-      );
-  });
-};
+export const updatePlaylistOpenTime = (playlistId) => {};
 
 
killedBy: Playlist Model should update playlist open time
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"last_open_time": Any<Number>, "message": "Playlist open time updated"}
Received: undefined

[Timeout] BlockStatement
db/playlistModel.js:84:43
 
 
 export const updatePlaylistOpenTime = (playlistId) => {
-  return new Promise((resolve, reject) => {
-      const currentTime = Date.now();
-      db.run(
-          'UPDATE playlists SET last_open_time = ? WHERE id = ?',
-          [currentTime, playlistId],
-          function (err) {
-              if (err) {
-                  reject(err);
-              } else if (this.changes === 0) {
-                  reject(new Error('Playlist not found'));
-              } else {
-                  resolve({
-                      message: 'Playlist open time updated',
-                      last_open_time: currentTime,
-                  });
-              }
-          },
-      );
-  });
+  return new Promise((resolve, reject) => {});
 };
 

[Killed] ArrayDeclaration
db/playlistModel.js:88:11
       const currentTime = Date.now();
       db.run(
           'UPDATE playlists SET last_open_time = ? WHERE id = ?',
-          [currentTime, playlistId],
+          [],
           function (err) {
               if (err) {
killedBy: Playlist Model should update playlist open time
statusReason: Error: Playlist not found

[Timeout] BlockStatement
db/playlistModel.js:89:26
       db.run(
           'UPDATE playlists SET last_open_time = ? WHERE id = ?',
           [currentTime, playlistId],
-          function (err) {
-              if (err) {
-                  reject(err);
-              } else if (this.changes === 0) {
-                  reject(new Error('Playlist not found'));
-              } else {
-                  resolve({
-                      message: 'Playlist open time updated',
-                      last_open_time: currentTime,
-                  });
-              }
-          },
+          function (err) {},
       );
   });

[Killed] ConditionalExpression
db/playlistModel.js:92:26
           function (err) {
               if (err) {
                   reject(err);
-              } else if (this.changes === 0) {
+              } else if (false) {
                   reject(new Error('Playlist not found'));
               } else {
killedBy: Playlist Model should throw an error when updating open time for non-existent playlist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"last_open_time": 1734454170951, "message": "Playlist open time updated"}

[Killed] BlockStatement
db/playlistModel.js:94:22
                   reject(err);
               } else if (this.changes === 0) {
                   reject(new Error('Playlist not found'));
-              } else {
-                  resolve({
-                      message: 'Playlist open time updated',
-                      last_open_time: currentTime,
-                  });
-              }
+              } else {}
           },
       );
killedBy: Playlist Model should update playlist open time
statusReason: Error: Playlist not found

[Killed] ObjectLiteral
db/playlistModel.js:95:27
               } else if (this.changes === 0) {
                   reject(new Error('Playlist not found'));
               } else {
-                  resolve({
-                      message: 'Playlist open time updated',
-                      last_open_time: currentTime,
-                  });
+                  resolve({});
               }
           },
killedBy: Playlist Model should update playlist open time
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- ObjectContaining {
-   "last_open_time": Any<Number>,
-   "message": "Playlist open time updated",
