[Survived] BlockStatement
db/userModel.js:3:34
 import { db } from './database.js';
 
-function addUser(user, callback) {
-  const { login, email, password } = user;
-  const stmt = db.prepare(
-    'INSERT INTO users (login, email, password) VALUES (?, ?, ?)',
-  );
-  stmt.run([login, email, password], function (err) {
-    callback(err, this);
-  });
-  stmt.finalize();
-}
+function addUser(user, callback) {}
 
 function getUserByLogin(login, callback) {

[Survived] StringLiteral
db/userModel.js:6:5
 function addUser(user, callback) {
   const { login, email, password } = user;
   const stmt = db.prepare(
-    'INSERT INTO users (login, email, password) VALUES (?, ?, ?)',
+    "",
   );
   stmt.run([login, email, password], function (err) {

[Killed] BlockStatement
db/userModel.js:8:53
   const stmt = db.prepare(
     'INSERT INTO users (login, email, password) VALUES (?, ?, ?)',
   );
-  stmt.run([login, email, password], function (err) {
-    callback(err, this);
-  });
+  stmt.run([login, email, password], function (err) {});
   stmt.finalize();
 }
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BlockStatement
db/userModel.js:14:42
   stmt.finalize();
 }
 
-function getUserByLogin(login, callback) {
-  db.get('SELECT * FROM users WHERE login = ?', [login], callback);
-}
+function getUserByLogin(login, callback) {}
 function updateUsername(userId, newLogin, callback) {
   const query = 'UPDATE users SET login = ? WHERE id = ?';
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] StringLiteral
db/userModel.js:15:10
 }
 
 function getUserByLogin(login, callback) {
-  db.get('SELECT * FROM users WHERE login = ?', [login], callback);
+  db.get("", [login], callback);
 }
 function updateUsername(userId, newLogin, callback) {
killedBy: Playlist Model should delete a playlist by ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Survived] BlockStatement
db/userModel.js:17:53
 function getUserByLogin(login, callback) {
   db.get('SELECT * FROM users WHERE login = ?', [login], callback);
 }
-function updateUsername(userId, newLogin, callback) {
-  const query = 'UPDATE users SET login = ? WHERE id = ?';
-  db.run(query, [newLogin, userId], (err) => {
-    callback(err);
-  });
-}
+function updateUsername(userId, newLogin, callback) {}
 export { addUser, getUserByLogin, updateUsername };
 

[Killed] StringLiteral
db/userModel.js:18:17
   db.get('SELECT * FROM users WHERE login = ?', [login], callback);
 }
 function updateUsername(userId, newLogin, callback) {
-  const query = 'UPDATE users SET login = ? WHERE id = ?';
+  const query = "";
   db.run(query, [newLogin, userId], (err) => {
     callback(err);
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Description 2", "id": 3207, "language_code": null, "last_open_time": 0, "name": "Playlist 2", "number_of_cards": 0, "user_id": 1}]

[Survived] BlockStatement
db/userModel.js:19:46
 }
 function updateUsername(userId, newLogin, callback) {
   const query = 'UPDATE users SET login = ? WHERE id = ?';
-  db.run(query, [newLogin, userId], (err) => {
-    callback(err);
-  });
+  db.run(query, [newLogin, userId], (err) => {});
 }
 export { addUser, getUserByLogin, updateUsername };
