[Killed] BlockStatement
db/wordModel.js:3:41
  import { db } from './database.js';
 
-function incrementWordCount(playlistId) {
-  return new Promise((resolve, reject) => {
-    const query =
-      'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?';
-    db.run(query, [playlistId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
-  });
-}
+function incrementWordCount(playlistId) {}
 
 function decrementWordCount(playlistId) {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "This is a test playlist", "id": 3222, "language_code": null, "last_open_time": 0, "name": "Test Playlist", "number_of_cards": 0, "user_id": 1}]

[Killed] BlockStatement
db/wordModel.js:4:43
  import { db } from './database.js';
 
 function incrementWordCount(playlistId) {
-  return new Promise((resolve, reject) => {
-    const query =
-      'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?';
-    db.run(query, [playlistId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Test Description", "id": 3249, "language_code": "en", "last_open_time": 0, "name": "Test Playlist", "number_of_cards": 0, "user_id": 1}]

[Survived] BlockStatement
db/wordModel.js:7:48
   return new Promise((resolve, reject) => {
     const query =
       'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?';
-    db.run(query, [playlistId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
+    db.run(query, [playlistId], function (err) {});
   });
 }

[Survived] ArrayDeclaration
db/wordModel.js:7:19
   return new Promise((resolve, reject) => {
     const query =
       'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?';
-    db.run(query, [playlistId], function (err) {
+    db.run(query, [], function (err) {
       if (err) reject(err);
       else resolve(this.changes);

[Killed] ConditionalExpression
db/wordModel.js:8:11
     const query =
       'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?';
     db.run(query, [playlistId], function (err) {
-      if (err) reject(err);
+      if (false) reject(err);
       else resolve(this.changes);
     });
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 4

[Killed] ConditionalExpression
db/wordModel.js:8:11
     const query =
       'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?';
     db.run(query, [playlistId], function (err) {
-      if (err) reject(err);
+      if (true) reject(err);
       else resolve(this.changes);
     });
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 4

[Killed] BlockStatement
db/wordModel.js:14:41
   });
 }
 
-function decrementWordCount(playlistId) {
-  return new Promise((resolve, reject) => {
-    const query =
-      'UPDATE playlists SET number_of_cards = number_of_cards - 1 WHERE id = ?';
-    db.run(query, [playlistId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
-  });
-}
+function decrementWordCount(playlistId) {}
 
 function getWordsByUserId(userId) {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
db/wordModel.js:15:43
 }
 
 function decrementWordCount(playlistId) {
-  return new Promise((resolve, reject) => {
-    const query =
-      'UPDATE playlists SET number_of_cards = number_of_cards - 1 WHERE id = ?';
-    db.run(query, [playlistId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BlockStatement
db/wordModel.js:18:48
   return new Promise((resolve, reject) => {
     const query =
       'UPDATE playlists SET number_of_cards = number_of_cards - 1 WHERE id = ?';
-    db.run(query, [playlistId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
+    db.run(query, [playlistId], function (err) {});
   });
 }
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Description 2", "id": 3399, "language_code": null, "last_open_time": 0, "name": "Playlist 2", "number_of_cards": 0, "user_id": 1}]

[Survived] BlockStatement
db/wordModel.js:25:35
   });
 }
 
-function getWordsByUserId(userId) {
-  return new Promise((resolve, reject) => {
-    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) reject(err);
-      else resolve(rows || []);
-    });
-  });
-}
+function getWordsByUserId(userId) {}
 
 function addWord(wordData) {

[Killed] BlockStatement
db/wordModel.js:26:43
 }
 
 function getWordsByUserId(userId) {
-  return new Promise((resolve, reject) => {
-    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) reject(err);
-      else resolve(rows || []);
-    });
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Survived] BlockStatement
db/wordModel.js:27:78
 
 function getWordsByUserId(userId) {
   return new Promise((resolve, reject) => {
-    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) reject(err);
-      else resolve(rows || []);
-    });
+    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {});
   });
 }

[Killed] StringLiteral
db/wordModel.js:27:12
 
 function getWordsByUserId(userId) {
   return new Promise((resolve, reject) => {
-    db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
+    db.all("", [userId], (err, rows) => {
       if (err) reject(err);
       else resolve(rows || []);
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Killed] ConditionalExpression
db/wordModel.js:28:11
 function getWordsByUserId(userId) {
   return new Promise((resolve, reject) => {
     db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) reject(err);
+      if (false) reject(err);
       else resolve(rows || []);
     });
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Survived] ConditionalExpression
db/wordModel.js:28:11
 function getWordsByUserId(userId) {
   return new Promise((resolve, reject) => {
     db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
-      if (err) reject(err);
+      if (true) reject(err);
       else resolve(rows || []);
     });

[Killed] ConditionalExpression
db/wordModel.js:29:20
   return new Promise((resolve, reject) => {
     db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
       if (err) reject(err);
-      else resolve(rows || []);
+      else resolve(false);
     });
   });
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3

[Killed] LogicalOperator
db/wordModel.js:29:20
   return new Promise((resolve, reject) => {
     db.all('SELECT * FROM words WHERE user_id = ?', [userId], (err, rows) => {
       if (err) reject(err);
-      else resolve(rows || []);
+      else resolve(rows && []);
     });
   });
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Survived] BlockStatement
db/wordModel.js:42:43
     user_id,
     playlist_id = null,
   } = wordData;
-  return new Promise((resolve, reject) => {
-    db.run(
-      'INSERT INTO words (word, translation, next_review_time, user_id, playlist_id) VALUES (?, ?, ?, ?, ?)',
-      [word, translation, next_review_time, user_id, playlist_id],
-      function (err) {
-        if (err) {
-          reject(err);
-        } else {
-          if (playlist_id) {
-            db.run(
-              'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',
-              [playlist_id],
-              (updateErr) => {
-                if (updateErr) reject(updateErr);
-                else resolve({ id: this.lastID });
-              },
-            );
-          } else {
-            console.log('No playlist_id');
-            resolve({ id: this.lastID });
-          }
-        }
-      },
-    );
-  });
+  return new Promise((resolve, reject) => {});
 }
 

[Killed] StringLiteral
db/wordModel.js:44:7
   } = wordData;
   return new Promise((resolve, reject) => {
     db.run(
-      'INSERT INTO words (word, translation, next_review_time, user_id, playlist_id) VALUES (?, ?, ?, ?, ?)',
+      "",
       [word, translation, next_review_time, user_id, playlist_id],
       function (err) {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Description 1", "id": 3495, "language_code": null, "last_open_time": 0, "name": "Playlist 1", "number_of_cards": 0, "user_id": 1}]

[Killed] ArrayDeclaration
db/wordModel.js:45:7
   return new Promise((resolve, reject) => {
     db.run(
       'INSERT INTO words (word, translation, next_review_time, user_id, playlist_id) VALUES (?, ?, ?, ?, ?)',
-      [word, translation, next_review_time, user_id, playlist_id],
+      [],
       function (err) {
         if (err) {
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"description": "Description for delete", "id": 3498, "language_code": null, "last_open_time": 0, "name": "Playlist to Delete", "number_of_cards": 0, "user_id": 1}]

[Survived] BlockStatement
db/wordModel.js:46:22
     db.run(
       'INSERT INTO words (word, translation, next_review_time, user_id, playlist_id) VALUES (?, ?, ?, ?, ?)',
       [word, translation, next_review_time, user_id, playlist_id],
-      function (err) {
-        if (err) {
-          reject(err);
-        } else {
-          if (playlist_id) {
-            db.run(
-              'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',
-              [playlist_id],
-              (updateErr) => {
-                if (updateErr) reject(updateErr);
-                else resolve({ id: this.lastID });
-              },
-            );
-          } else {
-            console.log('No playlist_id');
-            resolve({ id: this.lastID });
-          }
-        }
-      },
+      function (err) {},
     );
   });

[Survived] BlockStatement
db/wordModel.js:49:16
       function (err) {
         if (err) {
           reject(err);
-        } else {
-          if (playlist_id) {
-            db.run(
-              'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',
-              [playlist_id],
-              (updateErr) => {
-                if (updateErr) reject(updateErr);
-                else resolve({ id: this.lastID });
-              },
-            );
-          } else {
-            console.log('No playlist_id');
-            resolve({ id: this.lastID });
-          }
-        }
+        } else {}
       },
     );

[Killed] ConditionalExpression
db/wordModel.js:50:15
         if (err) {
           reject(err);
         } else {
-          if (playlist_id) {
+          if (true) {
             db.run(
               'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Survived] ConditionalExpression
db/wordModel.js:50:15
         if (err) {
           reject(err);
         } else {
-          if (playlist_id) {
+          if (false) {
             db.run(
               'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',

[Survived] ArrayDeclaration
db/wordModel.js:53:15
           if (playlist_id) {
             db.run(
               'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',
-              [playlist_id],
+              [],
               (updateErr) => {
                 if (updateErr) reject(updateErr);

[Survived] BlockStatement
db/wordModel.js:54:30
             db.run(
               'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',
               [playlist_id],
-              (updateErr) => {
-                if (updateErr) reject(updateErr);
-                else resolve({ id: this.lastID });
-              },
+              (updateErr) => {},
             );
           } else {

[Survived] ConditionalExpression
db/wordModel.js:55:21
               'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',
               [playlist_id],
               (updateErr) => {
-                if (updateErr) reject(updateErr);
+                if (true) reject(updateErr);
                 else resolve({ id: this.lastID });
               },

[Survived] ConditionalExpression
db/wordModel.js:55:21
               'UPDATE playlists SET number_of_cards = number_of_cards + 1 WHERE id = ?',
               [playlist_id],
               (updateErr) => {
-                if (updateErr) reject(updateErr);
+                if (false) reject(updateErr);
                 else resolve({ id: this.lastID });
               },

[Killed] BlockStatement
db/wordModel.js:59:18
                 else resolve({ id: this.lastID });
               },
             );
-          } else {
-            console.log('No playlist_id');
-            resolve({ id: this.lastID });
-          }
+          } else {}
         }
       },
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
db/wordModel.js:69:41
   });
 }
 
-function deleteWordById(wordId, userId) {
-  return new Promise((resolve, reject) => {
-    db.get(
-      'SELECT playlist_id FROM words WHERE id = ? AND user_id = ?',
-      [wordId, userId],
-      (err, row) => {
-        if (err) reject(err);
-        else {
-          const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
-          db.run(query, [wordId, userId], function (deleteErr) {
-            if (deleteErr) reject(deleteErr);
-            else if (row && row.playlist_id) {
-              decrementWordCount(row.playlist_id).then(resolve).catch(reject);
-            } else {
-              resolve();
-            }
-          });
-        }
-      },
-    );
-  });
-}
+function deleteWordById(wordId, userId) {}
 
 function updateWordById(wordId, updatedWordData) {
killedBy: Playlist Model should get playlists by user ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
db/wordModel.js:70:43
 }
 
 function deleteWordById(wordId, userId) {
-  return new Promise((resolve, reject) => {
-    db.get(
-      'SELECT playlist_id FROM words WHERE id = ? AND user_id = ?',
-      [wordId, userId],
-      (err, row) => {
-        if (err) reject(err);
-        else {
-          const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
-          db.run(query, [wordId, userId], function (deleteErr) {
-            if (deleteErr) reject(deleteErr);
-            else if (row && row.playlist_id) {
-              decrementWordCount(row.playlist_id).then(resolve).catch(reject);
-            } else {
-              resolve();
-            }
-          });
-        }
-      },
-    );
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Test Description", "id": 3691, "language_code": "en", "last_open_time": 0, "name": "Test Playlist", "number_of_cards": 0, "user_id": 1}]

[Survived] BlockStatement
db/wordModel.js:74:21
     db.get(
       'SELECT playlist_id FROM words WHERE id = ? AND user_id = ?',
       [wordId, userId],
-      (err, row) => {
-        if (err) reject(err);
-        else {
-          const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
-          db.run(query, [wordId, userId], function (deleteErr) {
-            if (deleteErr) reject(deleteErr);
-            else if (row && row.playlist_id) {
-              decrementWordCount(row.playlist_id).then(resolve).catch(reject);
-            } else {
-              resolve();
-            }
-          });
-        }
-      },
+      (err, row) => {},
     );
   });

[Killed] ConditionalExpression
db/wordModel.js:75:13
       'SELECT playlist_id FROM words WHERE id = ? AND user_id = ?',
       [wordId, userId],
       (err, row) => {
-        if (err) reject(err);
+        if (true) reject(err);
         else {
           const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
killedBy: Playlist Model should update playlist open time
statusReason: Error: Playlist not found

[Killed] ConditionalExpression
db/wordModel.js:75:13
       'SELECT playlist_id FROM words WHERE id = ? AND user_id = ?',
       [wordId, userId],
       (err, row) => {
-        if (err) reject(err);
+        if (false) reject(err);
         else {
           const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "name"

Expected value: "Playlist 1"
Received value: "Playlist 2"

[Killed] BlockStatement
db/wordModel.js:76:14
       [wordId, userId],
       (err, row) => {
         if (err) reject(err);
-        else {
-          const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
-          db.run(query, [wordId, userId], function (deleteErr) {
-            if (deleteErr) reject(deleteErr);
-            else if (row && row.playlist_id) {
-              decrementWordCount(row.playlist_id).then(resolve).catch(reject);
-            } else {
-              resolve();
-            }
-          });
-        }
+        else {}
       },
     );
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Survived] StringLiteral
db/wordModel.js:77:25
       (err, row) => {
         if (err) reject(err);
         else {
-          const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
+          const query = "";
           db.run(query, [wordId, userId], function (deleteErr) {
             if (deleteErr) reject(deleteErr);

[Killed] BlockStatement
db/wordModel.js:78:64
         if (err) reject(err);
         else {
           const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
-          db.run(query, [wordId, userId], function (deleteErr) {
-            if (deleteErr) reject(deleteErr);
-            else if (row && row.playlist_id) {
-              decrementWordCount(row.playlist_id).then(resolve).catch(reject);
-            } else {
-              resolve();
-            }
-          });
+          db.run(query, [wordId, userId], function (deleteErr) {});
         }
       },
killedBy: Playlist Model should get a playlist by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"description": "Test Description", "id": 3784, "language_code": "en", "name": "Test Playlist", "user_id": 1}
Received: null

[Killed] ArrayDeclaration
db/wordModel.js:78:25
         if (err) reject(err);
         else {
           const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
-          db.run(query, [wordId, userId], function (deleteErr) {
+          db.run(query, [], function (deleteErr) {
             if (deleteErr) reject(deleteErr);
             else if (row && row.playlist_id) {
killedBy: Playlist Model should update playlist open time
statusReason: Error: Playlist not found

[Killed] ConditionalExpression
db/wordModel.js:79:17
         else {
           const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
           db.run(query, [wordId, userId], function (deleteErr) {
-            if (deleteErr) reject(deleteErr);
+            if (false) reject(deleteErr);
             else if (row && row.playlist_id) {
               decrementWordCount(row.playlist_id).then(resolve).catch(reject);
killedBy: Playlist Model should delete a playlist by ID
statusReason: Error: Playlist not found

[Killed] ConditionalExpression
db/wordModel.js:79:17
         else {
           const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
           db.run(query, [wordId, userId], function (deleteErr) {
-            if (deleteErr) reject(deleteErr);
+            if (true) reject(deleteErr);
             else if (row && row.playlist_id) {
               decrementWordCount(row.playlist_id).then(resolve).catch(reject);
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Test Description", "id": 3809, "language_code": "en", "last_open_time": 1734454188683, "name": "Playlist to Update", "number_of_cards": 0, "user_id": 1}]

[Killed] ConditionalExpression
db/wordModel.js:80:22
           const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
           db.run(query, [wordId, userId], function (deleteErr) {
             if (deleteErr) reject(deleteErr);
-            else if (row && row.playlist_id) {
+            else if (true) {
               decrementWordCount(row.playlist_id).then(resolve).catch(reject);
             } else {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] LogicalOperator
db/wordModel.js:80:22
           const query = 'DELETE FROM words WHERE id = ? AND user_id = ?';
           db.run(query, [wordId, userId], function (deleteErr) {
             if (deleteErr) reject(deleteErr);
-            else if (row && row.playlist_id) {
+            else if (row || row.playlist_id) {
               decrementWordCount(row.playlist_id).then(resolve).catch(reject);
             } else {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Description 2", "id": 3837, "language_code": null, "last_open_time": 0, "name": "Playlist 2", "number_of_cards": 0, "user_id": 1}]

[Killed] BlockStatement
db/wordModel.js:82:20
             if (deleteErr) reject(deleteErr);
             else if (row && row.playlist_id) {
               decrementWordCount(row.playlist_id).then(resolve).catch(reject);
-            } else {
-              resolve();
-            }
+            } else {}
           });
         }
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Killed] StringLiteral
db/wordModel.js:97:7
 
   return new Promise((resolve, reject) => {
     db.get(
-      'SELECT playlist_id FROM words WHERE id = ?',
+      "",
       [wordId],
       (err, row) => {
killedBy: Playlist Model should get a playlist by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"description": "Test Description", "id": 3872, "language_code": "en", "name": "Test Playlist", "user_id": 1}
Received: null

[Survived] ArrayDeclaration
db/wordModel.js:98:7
   return new Promise((resolve, reject) => {
     db.get(
       'SELECT playlist_id FROM words WHERE id = ?',
-      [wordId],
+      [],
       (err, row) => {
         if (err) reject(err);

[Survived] BlockStatement
db/wordModel.js:99:21
     db.get(
       'SELECT playlist_id FROM words WHERE id = ?',
       [wordId],
-      (err, row) => {
-        if (err) reject(err);
-        else {
-          const oldPlaylistId = row ? row.playlist_id : null;
-
-          db.run(
-            'UPDATE words SET word = ?, translation = ?, playlist_id = ? WHERE id = ? AND user_id = ?',
-            [word, translation, playlistId, wordId, user_id],
-            async function (updateErr) {
-              if (updateErr) reject(updateErr);
-              else {
-                try {
-                  if (oldPlaylistId !== playlistId) {
-                    if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
-                    if (playlistId) await incrementWordCount(playlistId);
-                  }
-                  resolve(this.changes);
-                } catch (counterErr) {
-                  reject(counterErr);
-                }
-              }
-            },
-          );
-        }
-      },
+      (err, row) => {},
     );
   });

[Survived] BlockStatement
db/wordModel.js:101:14
       [wordId],
       (err, row) => {
         if (err) reject(err);
-        else {
-          const oldPlaylistId = row ? row.playlist_id : null;
-
-          db.run(
-            'UPDATE words SET word = ?, translation = ?, playlist_id = ? WHERE id = ? AND user_id = ?',
-            [word, translation, playlistId, wordId, user_id],
-            async function (updateErr) {
-              if (updateErr) reject(updateErr);
-              else {
-                try {
-                  if (oldPlaylistId !== playlistId) {
-                    if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
-                    if (playlistId) await incrementWordCount(playlistId);
-                  }
-                  resolve(this.changes);
-                } catch (counterErr) {
-                  reject(counterErr);
-                }
-              }
-            },
-          );
-        }
+        else {}
       },
     );

[Survived] BlockStatement
db/wordModel.js:107:40
           db.run(
             'UPDATE words SET word = ?, translation = ?, playlist_id = ? WHERE id = ? AND user_id = ?',
             [word, translation, playlistId, wordId, user_id],
-            async function (updateErr) {
-              if (updateErr) reject(updateErr);
-              else {
-                try {
-                  if (oldPlaylistId !== playlistId) {
-                    if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
-                    if (playlistId) await incrementWordCount(playlistId);
-                  }
-                  resolve(this.changes);
-                } catch (counterErr) {
-                  reject(counterErr);
-                }
-              }
-            },
+            async function (updateErr) {},
           );
         }

[Killed] ConditionalExpression
db/wordModel.js:108:19
             'UPDATE words SET word = ?, translation = ?, playlist_id = ? WHERE id = ? AND user_id = ?',
             [word, translation, playlistId, wordId, user_id],
             async function (updateErr) {
-              if (updateErr) reject(updateErr);
+              if (true) reject(updateErr);
               else {
                 try {
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Survived] ConditionalExpression
db/wordModel.js:108:19
             'UPDATE words SET word = ?, translation = ?, playlist_id = ? WHERE id = ? AND user_id = ?',
             [word, translation, playlistId, wordId, user_id],
             async function (updateErr) {
-              if (updateErr) reject(updateErr);
+              if (false) reject(updateErr);
               else {
                 try {

[Survived] BlockStatement
db/wordModel.js:109:20
             [word, translation, playlistId, wordId, user_id],
             async function (updateErr) {
               if (updateErr) reject(updateErr);
-              else {
-                try {
-                  if (oldPlaylistId !== playlistId) {
-                    if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
-                    if (playlistId) await incrementWordCount(playlistId);
-                  }
-                  resolve(this.changes);
-                } catch (counterErr) {
-                  reject(counterErr);
-                }
-              }
+              else {}
             },
           );
