[Killed] BlockStatement
db/wordModel.js:110:21
             async function (updateErr) {
               if (updateErr) reject(updateErr);
               else {
-                try {
-                  if (oldPlaylistId !== playlistId) {
-                    if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
-                    if (playlistId) await incrementWordCount(playlistId);
-                  }
-                  resolve(this.changes);
-                } catch (counterErr) {
+                try {} catch (counterErr) {
                   reject(counterErr);
                 }
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] ConditionalExpression
db/wordModel.js:111:23
               if (updateErr) reject(updateErr);
               else {
                 try {
-                  if (oldPlaylistId !== playlistId) {
+                  if (true) {
                     if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
                     if (playlistId) await incrementWordCount(playlistId);
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Killed] ConditionalExpression
db/wordModel.js:111:23
               if (updateErr) reject(updateErr);
               else {
                 try {
-                  if (oldPlaylistId !== playlistId) {
+                  if (false) {
                     if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
                     if (playlistId) await incrementWordCount(playlistId);
killedBy: Playlist Model should update playlist open time
statusReason: TypeError: Cannot read properties of null (reading 'last_open_time')

[Killed] ConditionalExpression
db/wordModel.js:112:25
               else {
                 try {
                   if (oldPlaylistId !== playlistId) {
-                    if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
+                    if (true) await decrementWordCount(oldPlaylistId);
                     if (playlistId) await incrementWordCount(playlistId);
                   }
killedBy: Playlist Model should update playlist open time
statusReason: TypeError: Cannot read properties of null (reading 'last_open_time')

[Survived] ConditionalExpression
db/wordModel.js:112:25
               else {
                 try {
                   if (oldPlaylistId !== playlistId) {
-                    if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
+                    if (false) await decrementWordCount(oldPlaylistId);
                     if (playlistId) await incrementWordCount(playlistId);
                   }

[Killed] ConditionalExpression
db/wordModel.js:113:25
                 try {
                   if (oldPlaylistId !== playlistId) {
                     if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
-                    if (playlistId) await incrementWordCount(playlistId);
+                    if (true) await incrementWordCount(playlistId);
                   }
                   resolve(this.changes);
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Killed] ConditionalExpression
db/wordModel.js:113:25
                 try {
                   if (oldPlaylistId !== playlistId) {
                     if (oldPlaylistId) await decrementWordCount(oldPlaylistId);
-                    if (playlistId) await incrementWordCount(playlistId);
+                    if (false) await incrementWordCount(playlistId);
                   }
                   resolve(this.changes);
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Description 2", "id": 4088, "language_code": null, "last_open_time": 0, "name": "Playlist 2", "number_of_cards": 0, "user_id": 1}]

[Survived] BlockStatement
db/wordModel.js:116:38
                     if (playlistId) await incrementWordCount(playlistId);
                   }
                   resolve(this.changes);
-                } catch (counterErr) {
-                  reject(counterErr);
-                }
+                } catch (counterErr) {}
               }
             },

[Survived] BlockStatement
db/wordModel.js:128:66
   });
 }
 
-const updateWordStage = async (wordId, stage, nextReviewTime) => {
-  const query =
-    'UPDATE words SET review_stage = ?, next_review_time = ? WHERE id = ?';
-  return new Promise((resolve, reject) => {
-    db.run(query, [stage, nextReviewTime, wordId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
-  });
-};
+const updateWordStage = async (wordId, stage, nextReviewTime) => {};
 
 export {

[Killed] StringLiteral
db/wordModel.js:130:5
 
 const updateWordStage = async (wordId, stage, nextReviewTime) => {
   const query =
-    'UPDATE words SET review_stage = ?, next_review_time = ? WHERE id = ?';
+    "";
   return new Promise((resolve, reject) => {
     db.run(query, [stage, nextReviewTime, wordId], function (err) {
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Survived] BlockStatement
db/wordModel.js:131:43
 const updateWordStage = async (wordId, stage, nextReviewTime) => {
   const query =
     'UPDATE words SET review_stage = ?, next_review_time = ? WHERE id = ?';
-  return new Promise((resolve, reject) => {
-    db.run(query, [stage, nextReviewTime, wordId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
-  });
+  return new Promise((resolve, reject) => {});
 };
 

[Killed] BlockStatement
db/wordModel.js:132:67
   const query =
     'UPDATE words SET review_stage = ?, next_review_time = ? WHERE id = ?';
   return new Promise((resolve, reject) => {
-    db.run(query, [stage, nextReviewTime, wordId], function (err) {
-      if (err) reject(err);
-      else resolve(this.changes);
-    });
+    db.run(query, [stage, nextReviewTime, wordId], function (err) {});
   });
 };
killedBy: Integration GET /playlists should return all playlists
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [{"description": "Test Description", "id": 4137, "language_code": "en", "last_open_time": 0, "name": "Playlist to Update", "number_of_cards": 0, "user_id": 1}]

[Killed] ArrayDeclaration
db/wordModel.js:132:19
   const query =
     'UPDATE words SET review_stage = ?, next_review_time = ? WHERE id = ?';
   return new Promise((resolve, reject) => {
-    db.run(query, [stage, nextReviewTime, wordId], function (err) {
+    db.run(query, [], function (err) {
       if (err) reject(err);
       else resolve(this.changes);
killedBy: Playlist Model should delete a playlist by ID
statusReason: Error: Playlist not found

[Killed] ConditionalExpression
db/wordModel.js:133:11
     'UPDATE words SET review_stage = ?, next_review_time = ? WHERE id = ?';
   return new Promise((resolve, reject) => {
     db.run(query, [stage, nextReviewTime, wordId], function (err) {
-      if (err) reject(err);
+      if (true) reject(err);
       else resolve(this.changes);
     });
killedBy: Integration DELETE /playlists/:id should delete a playlist
statusReason: Error: Playlist not found

[Survived] ConditionalExpression
db/wordModel.js:133:11
     'UPDATE words SET review_stage = ?, next_review_time = ? WHERE id = ?';
   return new Promise((resolve, reject) => {
     db.run(query, [stage, nextReviewTime, wordId], function (err) {
-      if (err) reject(err);
+      if (false) reject(err);
       else resolve(this.changes);
     });
